const noJosik = "조식은 제공하지 않습니다";
const noSuksik = '석식은 제공하지 않습니다';
const noHoliday = "휴일에는 제공하지 않습니다";

const weekly_giksik = [
  // 일요일
  [
    // 조식
    [
      ['해물완자강정', '쌀밥', '경상도식쇠고기국', '단호박전', 'SELF계란후라이', '미역줄기볶음', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['돼지고기고추장찌개', '김가루', '쌀밥', '햄전*케찹', '감자곤약조림', '숙주맛살무침', '깍두기', '딸기우유'],
      [noHoliday]
    ],
    // 석식
    [
      ['제육김치두루치기', '쌀밥', '얼갈이국', '연두부*양념장', '볼어묵조림', '도시락김', '열무김치'],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      ['고추장불고기', '쌀밥', '감자양파국', '새송이굴소스조림', 'SELF계란후라이', '무말랭이지', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['뼈다귀해장국', '쌀밥', '땡초감자전*초간장', '맛살브로콜리마요샐러드', '부추양파무침', '배추김치'],
      ['배떡st로제떡볶이', '쌀밥*김가루*마요네즈', '우동국물', '야채튀김', '김말이튀김', '새우튀김', '단무지', '배추김치', '쿨피스']
    ],
    // 석식
    [
      ['돼지갈비찜', '쌀밥', '맑은콩나물국', '청양풍잡채', '브로콜리볶음', '배추김치'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      ['만두돈까스*칸풍s', '쌀밥', '경상도식쇠고기국', '감자채당근볶음', 'SELF계란후라이', '배추김치', '모닝빵*딸기잼'],
      [noJosik]
    ],
    // 중식
    [
      ['제육김치찜', '쌀밥', '들깨미역국', '궁중떡볶이', '물만두*초간장', '깍두기'],
      ['떡만두라면', '참치마요주먹밥', '부추잡채찐만두', '단무지', '배추김치', '초코우유']
    ],
    // 석식
    [
      ['계란탁순두부찌개', '쌀밥', '왕동그랑땡전*케찹', '연근땅콩조림', '간장깻잎지', '배추김치'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      ['치킨너겟*머스타드', '쌀밥', '꼬맹이물만두국', '두부조림', 'SELF계란후라이', '양배추샐러드', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['메추리알감자조림', '쌀밥', '참치김치찌개', '두부계란구이*양념장', '우엉조림', '도시락김', '깍두기'],
      ['스팸김치마요덮밥', '우동국물', '자색고구마롤(3ea)', '양배추샐러드', '배추김치', '요구르트']
    ],
    // 석식
    [
      ['백짬뽕수제비', '쌀밥', '오코노미야끼', '콘샐러드', '단무지무침', '배추김치', '환타오렌지'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      ['카레닭조림', '쌀밥', '무채국', '어묵양파볶음', 'SELF계란후라이', '배추김치', '플래인요플레'],
      [noJosik]
    ],
    // 중식
    [
      ['숯불간장불고기', '쌀밥', '시금치국', '브로콜리깐풍', '알배기배추쌈*쌈장', '콩나물무침', '배추김치'],
      ['삼겹살김치덮밥*계란후라이', '우동국물', '옥수수고로케*케찹', '양배추샐러드', '배추김치', '매실쥬스']
    ],
    // 석식
    [
      ['언양식넙적불고기&데리야끼S', '쌀밥', '계란떡국', '떡볶이소스계란조림', '무생채', '배추김치'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      ['넙적제육강정', '쌀밥', '오징어무국', '맛살야채볶음', 'SELF계란후라이', '도시락김', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['떡고기산적부추무침', '쌀밥', '김치어묵국', '야채계란찜', '카레소스', '오복채', '배추김치'],
      ['함박스테이크&파인애플슬라이스', '쌀밥', '미니우동', '양념감자튀김', '피클', '배추김치', '레몬에이드']
    ],
    // 석식
    [
      ['콩나물야채쫄면', '쌀밥', '미소시루', '페스츄리핫도그', '스틱단무지', '배추김치', '요구르트'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      ['제육브로콜리볶음', '쌀밥', '미역국', '고추장멸치볶음', 'SELF계란후라이', '진미채무침', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['열무보리비빔밥', '강된장찌개', '치즈떡갈비구이', '도토리묵*양념장', '콘샐러드', '배추김치', '블루베리요플레'],
      [noHoliday]
    ],
    // 석식
    [
      ['육개장칼국수', '쌀밥', '한입카츠*데미s', '새송이야채볶음', '쥐어채무침', '배추김치'],
      [noSuksik]
    ]
  ]
]

const weekly_haksik = [
  // 일요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/병아리콩밥', '김치어묵국', '안동찜닭', '비빔야채만두', '숙주나물무침', '배추김치'],
      ['순살돈까스', '로제파스타/우동국', '파인애플샐러드', '배추김치/겨울제철생선']
    ],
    // 석식
    [
      ['쌀밥', '뚝)등뼈김치찌개', '갈릭꼬마돈까스', '브로콜리감자로림', '해초모듬샐러드', '배추김치'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '땡초시락국', '오돈두루치기', '두부구이&김치볶음', '다시마,양배추쌈&쌈장', '돌나물초장무침'],
      ['불닭마요덮밥', '우동국', '단팥고로케', '미숫가루라떼', '콘양배추샐러드/배추김치']
    ],
    // 석식
    [
      ['크래미김밥&겨자장', '미니)라면', '뿌리채소떡맛탕', '부추겉절이', '배추김치', '요구르트'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/보리밥', '닭개장', '미트볼치즈그라탕', '김치전1ea', '구이김&깨간장', '쑥갓겉절이', '배추김치'],
      ['삼겹김치덮밥', '사골국물', '찐만두', '맛살샐러드&땅콩참깨D', '단무지/배추김치']
    ],
    // 석식
    [
      ['쌀밥', '짭뽕수제비국', '사각햄전&케찹', '순대볶음', '모듬콩자반', '깻잎지', '배추김치'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '꽃게된장찌개', '청양풍간장두루치기', '가래떡꼬치1ea', '두부브로콜리무침', '무말랭이지', '배추김치'],
      ['즉석볶음짬뽕', '야채볶음밥&짜장s', '우동국', '돼지바빵', '황도샐러드/배추김치']
    ],
    // 석식
    [
      ['김치치즈아란치니', '크림스프', '함박스테이크&계란후라이', '키위드레싱샐러드', '배추김치'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '물만두국', '후르츠탕수육', '매콤고추짜장', '계란후라이1ea', '무생채', '배추김치'],
      ['오징어마요덮밥', '떡볶이/삶은계란', '우동국', '초코링요거트', '단무지/배추김치']
    ],
    // 석식
    [
      ['셀프나물비빔밥&계란후라이', '뚝)땡초된장찌개', '떡갈비조랭이조림', '식혜', '배추김치'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ]
]

const weekly_kyosik = [
  // 일요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['나주곰탕*당면사리', '쌀밥/잡곡밥', '고추마요순살치킨', '치즈감자전', '젓갈고추무침', '얼갈이겉절이', '깍두기', '수정과']
    ],
    // 석식
    [
      ['오징어볶음', '계란밥', '쑥갓어묵국', '고르곤졸라피자', '콩나물무침', '3가지맛김', '깍두기']
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['제육고추장불고기', '쌀밥/잡곡밥', '시래기국', '물비빔면', '고구마버터구이', '오복채무침', '포기김치', '오미자쥬스']
    ],
    // 석식
    [
      ['닭칼국수', '미니열무비빔밥', '찐만두3EA*양념장', '쥐어채야채무침', '단무지', '포기김치']
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['멕시칸돈까스', '쌀밥1/2', '크림스프', '토마토스파게티', '양배추샐러드', '애플드레싱', '오이피클', '깍두기']
    ],
    // 석식
    [
      ['삼겹살김치찌개', '쌀밥/잡곡밥', '콘치즈바싹불고기', '비빔만두', '젓갈고추무침', '유부숙주무침', '깍두기']
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['마파두부덮밥', '계란밥', '파송송계란탕', '맛쵸킹탕수육', '단무지', '포기김치', '새송이버섯볶음']
    ],
    // 석식
    [
      ['치즈닭갈비', '쌀밥/잡곡밥', '새알미역국', '통감자버터구이', '제육두부구이', '무말랭이무침', '깍두기']
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['순살후라이드치킨*양념치킨S', '파채떡볶이', '후리가케밥', '유부우동국물', '청경채샐러드', '애플드레싱', '깍두기', '레몬얼그레이티']
    ],
    // 석식
    [
      ['소고기버섯전골*칼국수사리', '쌀밥/잡곡밥', '양념고갈비', '청양풍잡채', '고추잎무침', '열무겉절이', '깍두기']
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ]
]