const noJosik = "조식은 제공하지 않습니다";
const noSuksik = '석식은 제공하지 않습니다';
const noHoliday = "휴일에는 제공하지 않습니다";

const weekly_giksik = [
  // 일요일
  [
    // 조식
    [
      ['해물완자강정', '쌀밥', '교자만두국', '고로케*케찹', 'SELF계란후라이', '도시락김', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['고추장닭볶음탕', '쌀밥', '무채국', '물만두*초간장', '쥐어채볶음', '숙주나물', '배추김치'],
      [noHoliday]
    ],
    // 석식
    [
      ['새우튀김오므라이스', '우동국물', '토마토스파게티', '감자버터오븐구이', '양배추샐러드', '배추김치', '사이다'],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      ['계란햄전*케찹', '쌀밥', '콩가루배추국', '채어묵볶음', 'SELF계란후라이', '배추김치', '콘샐러드'],
      [noJosik]
    ],
    // 중식
    [
      ['(뚝)김치만두전골*당면사리', '쌀밥', '미트볼굴소스조림', '새송이맛살볶음', '콩나물무침', '깍두기'],
      ['백종원의골목식당레시피!', '금악똣똣라면+몸밥(모자반)', '페스츄리햄치즈오븐구이', '양배추샐러드', '배추김치', '오렌지환타']
    ],
    // 석식
    [
      ['굴소스야채볶음밥&청양고추소세지구이', '우동국물', '크림스파게티', '황도샐러드', '피클', '배추김치'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      ['너비아니육전', '쌀밥', '계란떡국', '꽈리고추감자조림', 'SELF계란후라이', '배추김치', '몽쉘통통'],
      [noJosik]
    ],
    // 중식
    [
      ['숯불제육떡볶음', '쌀밥', '어묵무국', '브로콜리깐풍', '연두부*양념장', '마늘쫑무침', '배추김치'],
      ['참치생야채비빔밥', '어묵국', '소떡소떡구이*양념치킨S', '콘샐러드', '배추김치', '딸기우유']
    ],
    // 석식
    [
      ['비빔막국수', '쌀밥', '팽이장국', '만두돈까스*불닭깐풍S', '망고샐러드', '단무지', '배추김치'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      ['치킨너겟*머스타드', '쌀밥', '사골우거지국', '두부조림', 'SELF계란후라이', '푸질리케찹샐러드', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['안동찜닭', '쌀밥', '얼큰김치수제비국', '콩나물잡채', '골라먹는김(데리야끼*불닭)', '열무김치'],
      ['함박스테이크&파인애플슬라이스', '쌀밥', '미니우동', '감자튀김*케찹', '양배추샐러드', '피클/배추김치']
    ],
    // 석식
    [
      ['고추장제육불고기', '쌀밥', '콩나물국', '춘권튀김&칠리소스', '미역줄기볶음', '배추김치'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      ['간장불고기', '쌀밥', '김치어묵국', '브로콜리숙회', 'SELF계란후라이', '콩나물무침', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['제육김치찜', '쌀밥', '얼갈이된장국', '만두탕수', '오이양파무침', '숙주나물', '깍두기'],
      ['김밥볶음밥', '우동국물', '누들로제떡뽁이', '핫도그*케찹', '단무지', '배추김치', '쥬시쿨']
    ],
    // 석식
    [
      ['전주식비빔밥&계란후라이', '콩비지찌개', '후랑크케찹볶음', '무말랭이지', '배추김치', '비피더스'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      ['가자미무조림', '쌀밥', '순두부찌개', '감자채전*양념장', 'SELF계란후라이', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['부대찌개*라면사리', '쌀밥', '떡복이소스계란조림', '잡채말이어묵튀김*케찹', '부추양파무침', '배추김치'],
      ['볼케이노치킨스테이크', '쌀밥', '크림스프', '마카로니콘범벅', '양배추샐러드', '배추김치', '모닝빵']
    ],
    // 석식
    [
      ['새우볶음밥', '미역국', '페파로니피자', '샐러드파스타', '피클', '배추김치', '콜라'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      ['김치두루치키', '쌀밥', '시금치국', '연두부*양념장', 'SELF계란후라이', '열무김치'],
      [noJosik]
    ],
    // 중식
    [
      ['짜장면', '쌀밥', '계란파국', '매콤칠리탕수육', '단무지', '배추김치', '요구르트'],
      [noHoliday]
    ],
    // 석식
    [
      ['파채간장불고기', '쌀밥', '김치콩나물국', '단호박튀김*초간장', '양배추숙쌈*쌈장', '배추김치'],
      [noSuksik]
    ]
  ]
]

const weekly_haksik = [
  // 일요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '왕교자만두국', '묵은지찜닭', '온두부&양념장', '꼬시래기콩나물무침', '배추김치'],
      ['잔치국수', '메밀전병/추가밥', '크림브륄레와플', '쥬시쿨', '부추겉절이/배추김치']
    ],
    // 석식
    [
      ['쌀밥', '냄비)스팸감자짜글이', '쉬림프앤칩스&사우전D', '계란후라이1EA', '김가루무침', '오이마늘쫑지', '배추김치'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '참치김치찌개', '언양식직화너비아니1EA', '채어묵마늘쫑볶음', '단호박엿장조림', '미나리무생채', '배추김치'],
      ['훈제오리마요덮밥', '우동국', '미니)망향식비빔국수', '야채춘권튀김', '단무지/배추김치']
    ],
    // 석식
    [
      ['★돈까스정식★', '순살돈까쓰', '크림스프', '미트소스파스타', '계란듬뿍사라다빵', '오이피클/양배추샐러드', '배추김치'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['★생일자이벤트★', '쌀밥/렌틸콩밥', '홍합미역국', '매콤돼지고기장조림', '한식잡채', '애호박채전1EA', '양념고추지/배추김치'],
      ['불고기비빔밥', '뚝)된장찌개', '사각햄전&케찹', '이색묵&양념장', '배추김치/수정과']
    ],
    // 석식
    [
      ['쌀밥', '뚝)등뼈감자탕', '미트볼펜네칠리조림', '브로콜리맛살볶음', '도시락김1EA', '풋고추쌈장무침', '배추김치'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '맛살계란국', '마파두부', '탕수육강정', '스모크햄버섯볶음', '상추겉절이', '배추김치'],
      ['제주고기국수', '갈비만두&찐순대', '추가밥', '무말랭이지', '배추김치']
    ],
    // 석식
    [
      ['즉석오므라이스&칼집소세지구이', '우동국', '시리얼토스트/아이스티', '마카로니샐러드', '피클/배추김치'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/귀리밥', '얼큰수제비국', '시래기제육볶음', '두부땅콩데리강정', '삼색겨자냉채', '배추김치'],
      ['추억의도시락비빔밥', '즉석해장라면', '가래떡꼬치', '요구르트', '단무지/배추김치']
    ],
    // 석식
    [
      ['쌀밥', '맑은콩나물국', '숯불오징어볶음&소면', '햄스크램블드에그', '오이지', '배추김치', '슈가크루아상'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ]
]

const weekly_kyosik = [
  // 일요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/흑미밥', '닭다리삼계탕', '치즈감자전2ea', '매콤어묵야채볶음', '부추양파무침', '깍두기', '포도쥬스']
    ],
    // 석식
    [
      ['크림스프', '돼지고기필리프&계란후라이', '망고샐러드피자', '양념감자튀김', '오이피클', '포기김치']
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/찹쌀밥', '강된장찌개', '고추장제육불고기', '두부구이*양념장', '콩나물무침', '깻잎쌈*쌈장', '깍두기', '마테차']
    ],
    // 석식
    [
      ['유부초밥2ea', '닭칼국수', '찐만두3ea*양념장', '충무식오징어무침', '단무지', '포기김치']
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥1/2', '맑은우동국물', '짬뽕크림파스타', '떡갈비구아바오1ea', '청경채샐러드*흑임자D', '오이피클', '포기김치', '녹차']
    ],
    // 석식
    [
      ['쌀밥', '뼈다귀감자탕', '영양부추떡갈비', '해물부추전*양념장', '콩나물무침', '깍두기']
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/귀리밥', '삼겹살김치찌개', '순살파닭', '청양풍잡채', '우엉채조림', '얼갈이겉절이', '깍두기', '식혜']
    ],
    // 석식
    [
      ['무채국', '숯불향쭈꾸미비빔밥', '수제치즈계란찜', '감자고로케*칠리S', '오복채무침', '포기김치']
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['크림스프', '라따뚜이오므라이스&숯불향소세지', '마늘빵3ea', '양상추샐러드*키위D', '오이피클', '포기김치', '유자차']
    ],
    // 석식
    [
      ['쌀밥', '소고기버섯전골*칼국수사리', '고등어양념구이', '해물동그랑땡*케찹', '양념고추무침', '파래김*양념장', '깍두기']
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ]
]