const noJosik = "조식은 제공하지 않습니다";
const noSuksik = '석식은 제공하지 않습니다';
const noHoliday = "휴일에는 제공하지 않습니다";

const weekly_giksik = [
  // 일요일
  [
    // 조식
    [
      ['굴소스야채볶음밥', '계란만두국', '후랑크야채볶음', 'SELF계란후라이', '도시락김', '배추김치', '비피더스'],
      [noJosik]
    ],
    // 중식
    [
      ['휴게소st꼬치어묵우동', '쌀밥', '궁중떡볶이', '김말이튀김*초간장', '단무지', '배추김치', '청포도쥬스'],
      [noHoliday]
    ],
    // 석식
    [
      ['고추장불고기', '쌀밥', '두부된장국', '춘권튀김&칠리소스', '멸치볶음', '데리야끼맛김', '배추김치'],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      ['꼬치어묵탕(2ea)', '쌀밥', '메추리알감자조림', '진미채볶음', 'SELF계란후라이', '파래볶음자반', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['(뚝)순대돼지국밥&소면사리', '쌀밥', '순살파닭', '청양풍채어묵볶음', '부추양파무침', '배추김치'],
      ['스팸마요덮밥', '우동국물', '견과류매콤닭강정', '분식집떡볶이', '치킨무', '배추김치']
    ],
    // 석식
    [
      ['비프야채필라프', '크림스프', '함박펜네로제파스타', '양배추콘샐러드*드레싱', '피클', '배추김치', '베이비슈'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      ['해물수제비', '쌀밥', '떡갈비구이(1ea)', '데친두부*양념장', 'SELF계란후라이', '콘샐러드', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['삼겹살김치두루치기', '쌀밥', '호박된장국', '두부계란구이*양념장', '콩나물무침', '도시락김', '열무김치'],
      ['나가사끼짬뽕', '유부초밥(2ea)&쌀밥', '타코야끼(5ea)', '만다린샐러드', '락교', '배추김치']
    ],
    // 석식
    [
      ['왕동그랑땡전*케찹', '쌀밥', '참치김치찌개', '호박양파볶음', '무말랭이지', '불닭맛도시락김', '열무김치'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      ['미트볼새송이조림', '쌀밥', '미역국', '단호박전', 'SELF계란후라이', '양배추샐러드', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['(뚝)육개장*당면사리', '쌀밥', '불갈비소스섭산적구이', '청양백순대볶음', '오이양파무침', '배추김치'],
      ['불닭덮밥&콩나물사리', '우동국물', '자색고구마롤(3ea)', '샐러드파스타', '단무지', '배추김치']
    ],
    // 석식
    [
      ['짜파게티', '쌀밥', '계란파국', '불닭만두튀김', '단무지', '배추김치', '쥬시쿨'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      ['콩나물불고기', '쌀밥', '시금치된장국', '연두부*양념장', 'SELF계란후라이', '식빵&딸기잼', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['묵은지찜닭', '쌀밥', '어묵국', '감자버터오븐구이', '브로콜리맛살볶음', '우엉조림', '깍두기'],
      ['치즈라면', '쌀밥', '고기만두찜(4ea)', '콘샐러드', '단무지', '배추김치', '감귤쥬스']
    ],
    // 석식
    [
      ['우불고기덮밥&계란후라이', '미니김치유부우동', '오코노미야끼', '황도샐러드', '배추김치', '요구르트'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      ['강황카레라이스', '유부우동국물', '만두돈까스&깐풍s', 'SELF계란후라이', '마카로니콘범벅', '양배추샐러드', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['숯불향간장불고기', '쌀밥', '콩가루배추국', '들기름비빔막국수', '고구마맛탕', '배추김치'],
      ['치킨까스&매쉬드포테이토', '쌀밥', '우동국물', '양념감자튀김', '양배추샐러드', '피클', '배추김치']
    ],
    // 석식
    [
      ['스팸감자짜글이', '쌀밥', '한마리가자미버터구이', '어묵야채볶음', '콩나물무침', '깍두기'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      ['제육감자조림', '쌀밥', '들깨무채국', '새송이야채볶음', 'SELF계란후라이', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['부추바싹넙적불고기', '쌀밥', '콩비지찌개', '두부강정', '연근콩조림', '숙주나물', '깍두기'],
      [noHoliday]
    ],
    // 석식
    [
      ['안동찜닭&당면사리', '쌀밥', '미역국', '고구마튀김*초간장', '명엽채볶음', '배추김치'],
      [noSuksik]
    ]
  ]
]

const weekly_haksik = [
  // 일요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '뚝)순대돼지국밥&소면', '떡갈비데리조림', '김치전1EA', '건새우호박볶음', '양파장아찌', '배추김치'],
      ['숯불제육마요덮밥', '치킨까스&칠리S', '우동국', '샐러드&키위D', '배추김치/알새우칩']
    ],
    // 석식
    [
      ['★분식세트★', '김밥볶음밥&계란후라이', '우동국', '떡볶이/만두튀김', '야채쫄면', '단무지/배추김치', '피크닉사과맛'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '유부장국', '마라불고기', '고구마떡맛탕', '브로콜리숙회&초장', '도시락김1EA', '배추김치'],
      ['냄비김치우동', '미니)새우튀김알밥', '설탕핫도그&케찹', '요구르트', '단무지/배추김치']
    ],
    // 석식
    [
      ['뚝)직화닭갈비덮밥', '돈육순두부찌개', '해시브라운&케찹', '간장고추지', '배추김치', 'Hot)율무차'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '얼큰콩나물국', '양념치킨너겟강정', '하이라이스', '단호박마카로니범벅', '치커리겉절이', '배추김치'],
      ['카구리라면', 'Self)데리마요주먹밥', '비엔나소세지구이', '시리얼토스트/자몽허니블랙티', '단무지/배추김치']
    ],
    // 석식
    [
      ['고깃집돼지고기볶음밥', '미니)김치말이온국수', '두부계란찜', '간장깻잎지', '배추김치', '흰우우&딸기맛제티'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '어묵국', '고추장제육볶음', '동그랑땡전&케찹', '숙주나물', '쌈무', '배추김치'],
      ['대만식마늘쫑파스타', '홍루이젠샌드위치', '드링킹요구르트', '우동국/수제무피클', '배추김치']
    ],
    // 석식
    [
      ['짜계치(짜장면,계란,치즈)', '짬뽕국', '모듬만두튀김&깐풍소스', '추가밥', '황도샐러드', '배추김치'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['★비벼먹는날★', '쌀밥/흑미밥', '냄비)묵은지돈사태찌개', '계란후라이1EA', '쥐어채조림/호박나물', '김가루부추무침', '배추김치'],
      ['★돈까스정식★', '순살돈까스&새우튀김', '크림카레우동', '허니갈릭스틱/우동국', '오이피클/배추김치']
    ],
    // 석식
    [
      ['돈육콩나물밥&양념장', '뚝)땡초된장찌개', '임꺽정떡갈비1EA', '볼어묵곤약조림', '다시마채무침', '배추김치'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ]
]

const weekly_kyosik = [
  // 일요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/오곡밥', '순두부찌개', '숯불향숙주제육불고기', '데친두부*볶음김치', '우엉조림', '상추쌈*쌈장', '깍두기', '식혜']
    ],
    // 석식
    [
      ['쌀밥/오곡밥', '시래기국', '닭볶음탕', '수제단호박튀김*양념장', '양념고추무침', '오복채무침', '깍두기']
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['팽이장국', '카레라이스&불닭다리오븐구이', '무말랭이무침', '양배추샐러드*요거트D', '포기김치', '청포도쥬스']
    ],
    // 석식
    [
      ['쌀밥', '계란파국', '철판볶음짜장', '후르츠탕수육', '단무지', '포기김치', '사과맛요거트']
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/흑미밥', '나주곰탕*당면사리', '매콤닭강정', '연두부카프레제', '무말랭이무침', '얼갈이겉절이', '깍두기', '수정과']
    ],
    // 석식
    [
      ['옥수수밥', '시래기국', '더덕김치두루치기', '바싹한부추전', '도토리묵*양념장', '콩나물무침', '깍두기']
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥1/2', '크림스프', '순살등심돈까스', '포크볼비프파스타', '양배추샐러드&키위D', '오이피클', '포기김치', '석류주스']
    ],
    // 석식
    [
      ['쌀밥/병아리콩밥', '돼지국밥*소면사리', '너비아니콘치즈', '비빔막국수', '부추양파무침', '깍두기']
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['무채국', '불고기버섯비빔밥', '누들파채떡볶이', '튀김만두*양념장', '오복채무침', '포기김치', '유자차']
    ],
    // 석식
    [
      ['쌀밥', '팽이육개장', '조기구이*양념장', '청양풍잡채', '양념고추무침', '겉절이', '깍두기']
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ]
]