const noJosik = "조식은 제공하지 않습니다";
const noSuksik = '석식은 제공하지 않습니다';
const noHoliday = "휴일에는 제공하지 않습니다";

const weekly_giksik = [
  // 일요일
  [
    // 조식
    [
      ['제육떡볶음', '쌀밥', '두부된장국', '물만두*초간장', 'SELF계란후라이', '오복채', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['숯불향오징어볶음&소면사리', '쌀밥', '감자양파국', '계란말이(4)*케찹', '땅콩조림', '오이양파무침', '배추김치'],
      [noHoliday]
    ],
    // 석식
    [
      ['마파두부덮밥', '계란파국', '매콤제육강정', '흑임자야채샐러드', '짜사이', '배추김치', '레몬에이드'],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      ['해물완자전*케찹', '쌀밥', '얼큰수제비국', '두부조림', '쥐어채볶음', 'SELF계란후라이', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['숯불간장불고기', '쌀밥', '호박된장국', '어묵양파볶음', '콩나물무침', '양배추쌈*쌈장', '배추김치'],
      ['고구마순살돈까스', '쌀밥', '우동국물', '오지치즈후라이', '칠리샐러드파스타', '피클', '배추김치']
    ],
    // 석식
    [
      ['갓김치비빔국수', '쌀밥', '미소시루', '섭산적불갈비구이', '콘마요샐러드', '한입스틱단무지', '배추김치'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      ['비엔나케찹조림', '쌀밥', '사골떡국', '연두부*양념장', 'SELF계란후라이', '미역줄기볶음', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['맛쵸킹제육강정', '쌀밥', '계란만두국', '오징어부추전*양념장', '무생채', '도시락김', '배추김치'],
      ['왕소세지카레라이스', '우동국물', '청양풍볶음우동', '파인애플샐러드', '단무지', '배추김치', '초코우유']
    ],
    // 석식
    [
      ['돼지고기고추장찌개', '쌀밥', '미트볼떡볶음', '우엉조림', '숙주나물', '김파래자반', '배추김치'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      ['닭곰탕*소면사리', '쌀밥', '야채춘권*칠리s', '마늘쫑햄볶음', 'SELF계란후라이', '배추김치', '식빵&버터&딸기잼'],
      [noJosik]
    ],
    // 중식
    [
      ['오징어&생선까스*콘타르S', '쌀밥', '제육순두부찌개', '매콤감자조림', '무말랭이지', '배추김치', '딸기맛요플레'],
      ['소고기야채볶음밥', '미니김치우동', '점보춘권(2ea)', '불닭소스꼬치어묵(2ea)', '양배추샐러드', '깍두기']
    ],
    // 석식
    [
      ['토마토스파게티햄볶음', '쌀밥', '크림스프', '한입카츠&데미s', '피클', '양배추샐러드', '배추김치/콜라'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      ['고추장불고기', '쌀밥', '시금치국', '볼어묵조림', 'SELF계란후라이', '배추김치', '초코파이'],
      [noJosik]
    ],
    // 중식
    [
      ['돈육계란장조림', '쌀밥', '콩나물국', '참치김치전', '브로콜리숙회&초고추장', '명엽채볶음', '열무김치'],
      ['해물칼국수', '쌀밥+김가루+마요네즈', '갈비만두찜(3ea)', '콘샐러드', '단무지', '배추김치', '바나나우유']
    ],
    // 석식
    [
      ['매콤닭갈비', '쌀밥', '감자양파국', '단호박튀김*초간장', '깻잎무침', '연근조림', '배추김치'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      ['파채넙적너비아니', '쌀밥', '미역국', '브로콜리새송이볶음', 'SELF계란후라이', '도시락김', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['설렁탕*소면사리', '쌀밥', '한입돈까스*양념s', '매콤두부조림', '부추겉절이', '깍두기'],
      ['참치생야채비빔밥', '미소시루', '후랑크핫바*케찹', '실곤약야채무침', '단무지', '배추김치', '요구르트']
    ],
    // 석식
    [
      ['스팸김치볶음밥&계란후라이', '꼬치어묵탕(2ea)', '짜장떡볶이', '황도샐러드', '깍두기', '슈크림&사과요거트'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      ['안동찜닭', '쌀밥', '들깨무채국', '카레춘권튀김', 'SELF계란후라이', '우엉조림', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['고추장불고기비빔밥', '우동국물', '로제누들떡볶이', '청양백순대볶음', '단무지', '배추김치', '사이다'],
      [noHoliday]
    ],
    // 석식
    [
      ['함박스테이크*파인애플슬라이스', '쌀밥', '크림스프', '비빔야채국수', '양배추샐러드*드레싱', '배추김치'],
      [noSuksik]
    ]
  ]
]

const weekly_haksik = [
  // 일요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/완두콩밥', '짬뽕순두부찌개', '짜장불고기', '칠리만두', '단무지채부추무침', '배추김치'],
      ['돈까스마요덮밥', '볶음우동', '우동국', '마카로니샐러드', '모듬채소겉절이/배추김치']
    ],
    // 석식
    [
      ['닭갈비김치볶음밥&계란후라이', '우동국', '스팸두부구이', '콘양배추샐러드', '배추김치/요구르트'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '홍합살미역국', '묵은지두루치기', '후랑크브로콜리볶음', '연두부찜&양념장', '콩나물무침', '배추김치'],
      ['고구마피자 2pc', '햄야채볶음밥', '매콤토마토파스타', '우동국/쥬시쿨', '오이무피클/배추김치']
    ],
    // 석식
    [
      ['뚝)뚝배기크림짱뽕', '우동국', '후리가케김가루주먹밥', '고로케&케찹', '샐러드&자몽D/배추김치', '식빵러스크'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/강황밥', '뚝)부대찌개&치즈사리', '생선까스&타르타르S', '궁중떡볶이', '오이지', '도시락김1EA', '배추김치'],
      ['소금구이덮밥', '모듬튀김강정', '김가루무침/우동국', '장아찌/배추김치', '달고나치즈토스트/블랙커피']
    ],
    // 석식
    [
      ['쌀밥', '뚝)사골만두국', '언양식직화너비아니1EA', '두부튀김강정', '도토리묵채소무침', '무나물', '배추김치'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '나가사키짬뽕국', '마파불고기', '애기새송이어묵볶음', '삼색겨자냉채', '배추김치'],
      ['깍두기햄볶음밥&계란후라이', '우동국', '옛날st햄버거/콜라', '샐러드&키위D', '배추김치']
    ],
    // 석식
    [
      ['★모듬까스정식★', '돈까스,생선까스,새우튀김', '우동국', '쫄면채소무침', '추가밥', '감자사라다', '배추김치'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '고추장찌개', '소떡소떡강정', '케이준치킨샐러드', '미역줄기볶음', '실곤약마요무침', '배추김치'],
      ['햄치즈캘리포니아롤', '우동국', '봉골레파스타', '단호박견과류엿장조림', '샐러드/배추김치']
    ],
    // 석식
    [
      ['미트볼오므라이스', '우동국', '떠먹는고구마치즈고로케', '푸실리햄칠리볶음', '피클', '배추김치'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ]
]

const weekly_kyosik = [
  // 일요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['떡만두국', '쌀밥/잡곡밥', '임꺽정떡갈비', '불갈비소스', '비빔막국수', '오복채무침', '깍두기', '전통매실차']
    ],
    // 석식
    [
      ['비벼먹는닭볶음탕', '버터밥', '시래기국', '수제야채튀김*초간장', '무말랭이무침', '양파장아찌', '깍두기']
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['강호동불고기파스타', '페스츄리고구마피자', '크림스프', '양배추샐러드', '키위드레싱', '오이피클', '포기김치', '자몽티']
    ],
    // 석식
    [
      ['뼈다귀해장국*수제비사리', '쌀밥/잡곡밥', '치즈미트볼그라탕', '제육두부구이', '부추양파무침', '깍두기']
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['고깃집삼겹살볶음', '콩나물국', '고추마요순살치킨', '얼갈이겉절이', '오복채무침', '깍두기', '오미자쥬스']
    ],
    // 석식
    [
      ['돼지고기김치짜글이*우동사리', '왕새우튀김*타르타르s', '계란밥', '견과류고구마맛탕', '고들빼기무침', '깍두기']
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['제육고추장불고기', '쌀밥/잡곡밥', '강된장찌개', '해물파전*양념장', '콩나물무침', '깻잎쌈*쌈장', '깍두기', '단호박식혜']
    ],
    // 석식
    [
      ['김치우동', '미니참치마요덮밥', '고구마크로켓', '양배추샐러드', '유자D', '마늘쫑무침', '깍두기']
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['고구마치즈돈까스&데미s', '쌀밥1/2', '크림스프', '감자치즈보트', '양배추샐러드', '애플드레싱', '오이피클', '포기김치', '복숭아아이스티']
    ],
    // 석식
    [
      ['차돌김치순두부찌개', '쌀밥/잡곡밥', '콘치즈바싹불고기', '맛살치즈계란찜', '연근땅콩조림', '3가지맛김', '깍두기']
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ]
]