const noJosik = "조식은 제공하지 않습니다";
const noSuksik = '석식은 제공하지 않습니다';
const noHoliday = "휴일에는 제공하지 않습니다";

const weekly_giksik = [
  // 일요일
  [
    // 조식
    [
      ['고추장수제비', '쌀밥', '후랑크야채볶음', '연근조림', 'SELF계란후라이', '오복채', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['김치제육돈깍뚝조림', '쌀밥', '시금치국', '두부계란구이*양념장', '어묵양파볶음', '대파겉절이', '깍두기'],
      [noHoliday]
    ],
    // 석식
    [
      ['참치생야채비빔밥', '우동국물', '매콤크랩바*케찹', '고구마맛탕', '단무지', '배추김치'],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      ['얼큰장터국*당면사리', '쌀밥', '치킨까스*매쉬드포테이토', '가지양파볶음', 'SELF계란후라이', '마늘쫑절임', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['콩나물불고기', '쌀밥', '제육순두부찌개', '고구마고로케*케찹', '양배추숙쌈/쌈장', '배추김치'],
      ['새우볶음밥', 'SELF계란후라이', '크림스프', '페스츄리햄치즈오븐구이', '샐러드파스타', '피클', '콘샐러드', '배추김치', '환타오렌지']
    ],
    // 석식
    [
      ['순두부열라면', '쌀밥', '삼색물만두*초간장', '어묵채야채볶음', '단무지', '배추김치', '요구르트'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      ['오징어동그랑땡전*케찹', '쌀밥', '계란떡국', '꽈리고추감자조림', 'SELF계란후라이', '파래볶음자반', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['파채마요넙적불고기', '쌀밥', '감자양파국', '카레춘권', '비빔막국수', '콩나물무침', '배추김치'],
      ['짜파게티*슬라이스치즈', '쌀밥', '우동국물', '불닭만두(4ea)', '단무지', '배추김치', '복숭아요플레']
    ],
    // 석식
    [
      ['치즈닭갈비', '쌀밥', '콩비지찌개', '맛살브로콜리볶음', '연두부*양념장', '배추김치'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      ['제육깻잎두루치기', '쌀밥', '호박된장국', '데친두부*양념장', 'SELF계란후라이', '숙주미나리무침', '열무김치'],
      [noJosik]
    ],
    // 중식
    [
      ['닭개장*당면사리', '쌀밥', '넙적후르츠탕수육', '고구마맛탕', '얼갈이겉절이', '도시락김', '깍두기'],
      ['크리미어니언치킨까스*청양고추', '쌀밥', '우동국물', '치즈오븐스파게티', '양배추샐러드', '피클', '배추김치']
    ],
    // 석식
    [
      ['김치볶음밥*계란후라이', '꼬치어묵탕', '미트볼야채조림', '새송이피망볶음', '콩조림', '깍두기', '딸기우유'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      ['사골떡만두국', '쌀밥', '고추장전', '채어묵볶음', 'SELF계란후라이', '부추적채무침', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['고추장닭볶음탕', '쌀밥', '미역국', '카레떡볶이', '브로콜리*초장', '무생채', '배추김치'],
      ['나물가득비빔밥&계란후라이', '유부된장국', '소떡소떡강정', '오복채', '배추김치', '캐플쥬스']
    ],
    // 석식
    [
      ['해물짬뽕', '쌀밥', '두부강정', '제육강정', '콩나물겨자채', '단무지', '배추김치'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      ['달걀오므라이스', '미소시루', '함박스테이크', '푸질리콘범벅', '양배추샐러드', 'SELF계란후라이', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['숯불제육떡볶음', '쌀밥', '어묵무국', '만두깐풍', '우엉조림', '무말랭이지', '배추김치'],
      ['꼬치어묵우동', '쌀밥', '치킨가라아게', '콘샐러드', '락교', '배추김치', '베이비슈']
    ],
    // 석식
    [
      ['왕동그랑땡전*케찹', '쌀밥', '돼지고기김치찌개', '볼어묵풋고추조림', '돌나물초장무침', '도시락김', '깍두기'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      ['떡고기산적구이', '쌀밥', '김치콩나물국', '브로콜리맛살볶음', '명엽채볶음', 'SELF계란후라이', '배추김치'],
      [noJosik]
    ],
    // 중식
    [
      ['온메밀소바', '쌀밥', '만두돈까스*불닭소스', '마카로니콘범벅', '양배추샐러드', '피클', '배추김치', '사이다'],
      [noHoliday]
    ],
    // 석식
    [
      ['오돈불고기', '쌀밥', '쇠고기미역국', '감자채당근볶음', '숙주맛살나물', '고추지', '배추김치'],
      [noSuksik]
    ]
  ]
]

const weekly_haksik = [
  // 일요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/옥수수밥', '유부우동국', '바베큐폭찹불고기', '마늘종어묵볶음', '홍합콩나물찜', '배추김치'],
      ['제주고기국수', '추가밥', '떡갈비스테이크', '갈비만두', '부추겉절이/배추김치']
    ],
    // 석식
    [
      ['제육두루치기덮밥', '생선까스&자몽타르D', '우동국', '칠리콘마카로니', '배추김치', '요구르트'],
      [noSuksik]
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '뚝)순대돼지국밥', '쏘야볶음', '늙은호박전1EA', '콩나물무침', '오이생채', '배추김치'],
      ['참치마요비빔밥', '컵라면(진라면매운맛)', '비엔나소세지구이', '단무지', '배추김치']
    ],
    // 석식
    [
      ['쌀밥', '냄비)스팸감자짜글이', '계란말이&케찹', '모듬튀김강정', '김가루무침', '돌나물초장무침', '배추김치'],
      [noSuksik]
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥/흑미밥', '계란떡국', '카레맛닭볶음탕', '두부데리강정', '모듬해초초장무침', '배추김치'],
      ['페스츄리콘피자', '청양크림스파게티', '우동국', '후르츠샐러드/피클', '배추김치/피크닉음료']
    ],
    // 석식
    [
      ['매콤토마토리조또&칼집소세지구이', '우동국', '고구마계란사라다빵', '그린샐러드&유자D', '피클/배추김치'],
      [noSuksik]
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '순두부계란백탕', '양념치킨너겟', '하이라이스', '이색묵&양념장', '고춧잎무침', '배추김치'],
      ['햄오므라이스&순살돈까스', '매콤어묵국', '샐러드모듬', '단무지/배추김치']
    ],
    // 석식
    [
      ['쌀밥', '뚝)삼겹살된장찌개', '임꺽정떡갈비1EA', '비빔야채소면', '미역줄기맛살볶음', '무생채', '배추김치'],
      [noSuksik]
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      ['쌀밥', '시금치된장국', '묵은지두루치기', '온두부', '해시브라운1EA&케찹', '모듬장아찌', '배추김치'],
      ['일본식라멘', '후리가케밥', '튀김왕교자만두', '크래미샐러드', '산고추지/배추김치']
    ],
    // 석식
    [
      ['즉석볶음우동', '훈제오리볶음밥', '우동국', '미니꿀호떡버거', '양배추샐러드', '배추김치'],
      [noSuksik]
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik],
      [noJosik]
    ],
    // 중식
    [
      [noHoliday],
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday],
      [noSuksik]
    ]
  ]
]

const weekly_kyosik = [
  // 일요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ],

  // 월요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['떡만두국', '쌀밥/잡곡밥', '임꺽정떡갈비', '불갈비소스', '해물파전*양념장', '젓갈고추무침', '얼갈이겉절이', '깍두기', '전통매실차']
    ],
    // 석식
    [
      ['강황카레라이스', '유부장국', '닭가슴살퀘사디아', '견과류고구마맛탕', '양배추샐러드', '포기김치']
    ]
  ],

  // 화요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['치킨스테이크', '유부우동국물', '샐러드파스타', '감자튀김*갈릭디핑S', '오이피클', '깍두기', '자몽허니블랙티']
    ],
    // 석식
    [
      ['등뼈김치찌개', '쌀밥/잡곡밥', '만두돈까스*칠리s', '도토리묵상추무침', '무말랭이무침', '깍두기']
    ]
  ],

  // 수요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['숙주제육불고기', '쌀밥/잡곡밥', '강된장찌개', '데친두부*김치볶음', '우엉조림', '콩나물무침', '깍두기']
    ],
    // 석식
    [
      ['돼지국밥*소면사리', '쌀밥/잡곡밥', '치즈미트볼그라탕', '비빔막국수', '부추양파무침', '깍두기']
    ]
  ],

  // 목요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['오므라이스&데미s', '크림스프', '고추마요순살치킨', '양배추샐러드', '키위드레싱', '오이피클', '포기김치', '마테차']
    ],
    // 석식
    [
      ['부대찌개*라면사리', '쌀밥/잡곡밥', '왕새우튀김*타르타르s', '파닭만두', '고추잎무침', '유부숙주무침', '깍두기']
    ]
  ],

  // 금요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      ['숯불향차돌짬뽕', '도제유부초밥', '오코노미야끼', '어묵고추장볶음', '단무지', '포기김치']
    ],
    // 석식
    [
      ['닭곰탕*당면사리', '쌀밥/잡곡밥', '조기구이', '해물잡채완자전*케찹', '마늘종무침', '깍두기']
    ]
  ],

  // 토요일
  [
    // 조식
    [
      [noJosik]
    ],
    // 중식
    [
      [noHoliday]
    ],
    // 석식
    [
      [noHoliday]
    ]
  ]
]